piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_dma.c
/**
 *******************************************************************************
 * @file    MDR32VF0xI_dma.c
 * @author  Milandr Application Team
 * @version V0.2.0
 * @date    03/04/2025
 * @brief   This file contains all the DMA firmware functions.
 *******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "MDR32VF0xI_dma.h"

/** @addtogroup MDR32VF0xI_StdPeriph_Driver MDR32VF0xI Standard Peripheral Driver
 * @{
 */

/** @defgroup DMA DMA
 * @{
 */

/** @addtogroup DMA_Private_Variables DMA Private Variables
 * @{
 */

/**
 * @brief DMA channel control data table.
 */
#if defined(DMA_ALTERNATE_DATA)
#define DMA_CHANNELS_MODIFIER 1
#else
#define DMA_CHANNELS_MODIFIER 0
#endif

#if defined(__GNUC__) /* GCC compiler. */
__RAM_AHB_BSS DMA_CtrlData_TypeDef DMA_ControlTable[(32 * DMA_CHANNELS_MODIFIER) + DMA_CHANNELS_NUMBER] __attribute__((aligned(1024)));
#elif defined(__ICCRISCV__) /* IAR RISC-V compiler. */
__RAM_AHB_BSS DMA_CtrlData_TypeDef DMA_ControlTable[(32 * DMA_CHANNELS_MODIFIER) + DMA_CHANNELS_NUMBER] __attribute__((aligned(1024)));
#else
#error "Unsupported compiler is used."
#endif

/** @} */ /* End of the group DMA_Private_Variables */

/** @defgroup DMA_Exported_Functions DMA Exported Functions
 * @{
 */

/**
 * @brief  Set DMA to safe state. Disable burst mode, mask and enable all channels, enable DMA.
 * @param  None.
 * @return None.
 */
void DMA_DeInit(void)
{
    MDR_DMA->CFG               = 0;          /* Master Enable off. */
    MDR_DMA->CTRL_BASE_PTR     = 0;          /* Control data base pointer. */
    MDR_DMA->CHNL_SW_REQUEST   = 0;          /* Disable all software requests. */
    MDR_DMA->CHNL_USEBURST_SET = 0xFFFFFFFF; /* Disable burst mode. */

    MDR_DMA->CHNL_ENABLE_CLR   = 0xFFFFFFFF;          /* Clear channel enable. */
    MDR_DMA->CHNL_PRI_ALT_CLR  = 0xFFFFFFFF;          /* Reset to primary data structure .*/
    MDR_DMA->CHNL_PRIORITY_CLR = 0xFFFFFFFF;          /* Reset to default priority. */
    MDR_DMA->ERR_CLR           = DMA_ERR_CLR_ERR_CLR; /* Clear dma_err status. */

    MDR_DMA->CFG               = DMA_CFG_MASTER_ENABLE; /* Master Enable on. */
    MDR_DMA->CHNL_REQ_MASK_SET = 0xFFFFFFFF;            /* Mask all channels. */
    MDR_DMA->CHNL_ENABLE_SET   = 0xFFFFFFFF;            /* Enable all channels. */
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    CLIC_ClearPendingIRQ(DMA_IRQn);
#endif
}

/**
 * @brief  Enable or disable the DMA controller.
 * @param  NewState: @ref FunctionalState - a new state of the DMA controller.
 * @return None.
 */
void DMA_Cmd(FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Enable/Disable the DMA controller. */
    if (NewState != DISABLE) {
        MDR_DMA->CFG = DMA_CFG_MASTER_ENABLE; /* Master Enable on. */
    } else {
        MDR_DMA->CFG = 0; /* Master Enable off. */
    }
}

/**
 * @brief  Get the DMA controller work state.
 * @param  None.
 * @return @ref FunctionalState - the current work state of the DMA controller.
 */
FunctionalState DMA_GetCmdState(void)
{
    FunctionalState State;

    if ((MDR_DMA->STATUS & DMA_STATUS_MASTER_ENABLE) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

    return State;
}

/**
 * @brief  Initialize the DMA control data structure according to the specified parameters.
 * @param  DMA_CtrlDataPtr: The pointer to the @ref DMA_CtrlData_InitTypeDef structure
 *         that contains the control data structure to initialize.
 * @param  DMA_CtrlTablePtr: The pointer to the @ref DMA_CtrlData_TypeDef structure that
 *         contains the initial control data configuration, provided by the application.
 * @return None.
 */
void DMA_CtrlDataInit(const DMA_CtrlData_InitTypeDef* DMA_CtrlDataPtr, DMA_CtrlData_TypeDef* DMA_CtrlTablePtr)
{
    /* Check the parameters. */
    assert_param(IS_DMA_DATA_INC(DMA_CtrlDataPtr->DMA_SourceIncSize));
    assert_param(IS_DMA_DATA_INC(DMA_CtrlDataPtr->DMA_DestIncSize));
    assert_param(IS_DMA_MEMORY_DATA_SIZE(DMA_CtrlDataPtr->DMA_MemoryDataSize));
    assert_param(IS_DMA_MODE(DMA_CtrlDataPtr->DMA_Mode));
    assert_param(((DMA_CtrlDataPtr->DMA_Mode == DMA_MODE_MEM_SG_PRIMARY) || (DMA_CtrlDataPtr->DMA_Mode == DMA_MODE_PER_SG_PRIMARY)) ? IS_DMA_SG_PRIMARY_CYCLE_SIZE(DMA_CtrlDataPtr->DMA_CycleSize) : IS_DMA_CYCLE_SIZE(DMA_CtrlDataPtr->DMA_CycleSize));
    assert_param(IS_DMA_ARB_PERIOD(DMA_CtrlDataPtr->DMA_ArbitrationPeriod));

    /* DMA source data end address. */
    if (DMA_CtrlDataPtr->DMA_SourceIncSize == DMA_DATA_INC_NO) {
        DMA_CtrlTablePtr->DMA_SourceEndAddr = DMA_CtrlDataPtr->DMA_SourceBaseAddr;
    } else {
        DMA_CtrlTablePtr->DMA_SourceEndAddr = (DMA_CtrlDataPtr->DMA_SourceBaseAddr +
                                               (((uint32_t)DMA_CtrlDataPtr->DMA_CycleSize - 1) << ((uint32_t)(DMA_CtrlDataPtr->DMA_SourceIncSize))));
    }

    /* DMA destination data end address. */
    if ((DMA_CtrlDataPtr->DMA_Mode == DMA_MODE_MEM_SG_PRIMARY) || (DMA_CtrlDataPtr->DMA_Mode == DMA_MODE_PER_SG_PRIMARY)) {
        /* Scatter-gather mode, alternate data structure end address. */
        DMA_CtrlTablePtr->DMA_DestEndAddr = (DMA_CtrlDataPtr->DMA_DestBaseAddr + 12);
    } else {
        /* Other modes. */
        if (DMA_CtrlDataPtr->DMA_DestIncSize == DMA_DATA_INC_NO) {
            DMA_CtrlTablePtr->DMA_DestEndAddr = DMA_CtrlDataPtr->DMA_DestBaseAddr;
        } else {
            DMA_CtrlTablePtr->DMA_DestEndAddr = (DMA_CtrlDataPtr->DMA_DestBaseAddr +
                                                 (((uint32_t)DMA_CtrlDataPtr->DMA_CycleSize - 1) << ((uint32_t)(DMA_CtrlDataPtr->DMA_DestIncSize))));
        }
    }

    /* DMA control data. */
    DMA_CtrlTablePtr->DMA_Control.w = (((uint32_t)(DMA_CtrlDataPtr->DMA_DestIncSize) << DMA_CHANNEL_CFG_DST_INC_Pos) |
                                       ((uint32_t)DMA_CtrlDataPtr->DMA_MemoryDataSize) |
                                       ((uint32_t)(DMA_CtrlDataPtr->DMA_SourceIncSize) << DMA_CHANNEL_CFG_SRC_INC_Pos) |
                                       ((uint32_t)DMA_CtrlDataPtr->DMA_ArbitrationPeriod) |
                                       (((uint32_t)DMA_CtrlDataPtr->DMA_CycleSize - 1) << DMA_CHANNEL_CFG_N_MINUS_1_Pos) |
                                       (uint32_t)(DMA_CtrlDataPtr->DMA_Mode));
}

/**
 * @brief  Initialize the DMA channel DMA_ControlTable structure according to the specified parameters.
 * @param  DMA_Channel: Select a DMA channel.
 *         This parameter can be in the range from 0 to 31 or a value of the @ref DMA_ValidChannel_TypeDef.
 * @param  DMA_CtrlDataType: @ref DMA_DataStructSelection_TypeDef - select the data structure.
 * @param  DMA_CtrlStruct: The pointer to the @ref DMA_CtrlData_InitTypeDef structure that contains the initial
 *         control data configuration, provided by the application for the specified DMA Channel.
 * @return None.
 */
void DMA_CtrlInit(uint8_t DMA_Channel, DMA_DataStructSelection_TypeDef DMA_CtrlDataType, const DMA_CtrlData_InitTypeDef* DMA_CtrlStruct)
{
    /* Check the parameters. */
    assert_param(IS_DMA_CHANNEL(DMA_Channel));
    assert_param(IS_DMA_SELECT_DATA_STRUCTURE(DMA_CtrlDataType));

    if (DMA_CtrlDataType == DMA_CTRL_DATA_PRIMARY) {
        /* Primary control data init. */
        DMA_CtrlDataInit(DMA_CtrlStruct, &DMA_ControlTable[DMA_Channel]);
#if defined(DMA_ALTERNATE_DATA)
    } else {
        /* Alternate control data init. */
        DMA_CtrlDataInit(DMA_CtrlStruct, &DMA_ControlTable[32 + DMA_Channel]);
#endif
    }
}

/**
 * @brief  Initialize the DMA scatter-gather task structure according to the specified parameters.
 * @param  DMA_Task: Specify the current task number. Numeration begins with 0.
 * @param  DMA_CtrlStruct: the pointer to the @ref DMA_CtrlData_InitTypeDef structure
 *         that contains the control data information for the specified task.
 * @param  DMA_SG_TaskArray: the pointer to the @ref DMA_CtrlData_TypeDef array that
 *         contains the copy of the alternate control data information for the specified task.
 * @return None.
 */
void DMA_SG_CtrlInit(uint32_t DMA_Task, DMA_CtrlData_TypeDef* DMA_SG_TaskArray, const DMA_CtrlData_InitTypeDef* DMA_CtrlStruct)
{
    DMA_CtrlDataInit(DMA_CtrlStruct, &DMA_SG_TaskArray[DMA_Task]);
}

/**
 * @brief  Initialize the DMA channel according to
 *         the specified parameters in the DMA_InitStruct.
 * @param  DMA_Channel: Select a DMA channel.
 *         This parameter can be in the range from 0 to 31 or a value of the @ref DMA_ValidChannel_TypeDef.
 * @param  DMA_InitStruct: The pointer to the @ref DMA_Channel_InitTypeDef structure that
 *         contains the configuration information for the specified DMA channel.
 * @return None.
 */
void DMA_ChannelInit(uint8_t DMA_Channel, const DMA_Channel_InitTypeDef* DMA_InitStruct)
{
    /* Check the parameters. */
    assert_param(IS_DMA_CHANNEL(DMA_Channel));
    assert_param(IS_FUNCTIONAL_STATE(DMA_InitStruct->DMA_UseHighPriority));
    assert_param(IS_FUNCTIONAL_STATE(DMA_InitStruct->DMA_UseBurst));
    assert_param(IS_DMA_SELECT_DATA_STRUCTURE(DMA_InitStruct->DMA_SelectDataStructure));

