piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_dma.c
    /* Check the CTRL_BASE_PTR initialization. */
    MDR_DMA->CTRL_BASE_PTR = (uint32_t)DMA_ControlTable;

    /* Primary control data init. */
    if (DMA_InitStruct->DMA_PriCtrlData) {
        DMA_CtrlDataInit(DMA_InitStruct->DMA_PriCtrlData, &DMA_ControlTable[DMA_Channel]);
    }

#if defined(DMA_ALTERNATE_DATA)
    /* Alternate control data init. */
    if (DMA_InitStruct->DMA_AltCtrlData) {
        DMA_CtrlDataInit(DMA_InitStruct->DMA_AltCtrlData, &DMA_ControlTable[32 + DMA_Channel]);
    }
#endif

    /* Burst mode. */
    if (DMA_InitStruct->DMA_UseBurst == ENABLE) {
        MDR_DMA->CHNL_USEBURST_SET = (1 << DMA_Channel);
    } else {
        MDR_DMA->CHNL_USEBURST_CLR = (1 << DMA_Channel);
    }

    /* Primary or alternate control data structure selection. */
    if (DMA_InitStruct->DMA_SelectDataStructure == DMA_CTRL_DATA_PRIMARY) {
        MDR_DMA->CHNL_PRI_ALT_CLR = (1 << DMA_Channel); /* Use primary. */
    } else {
        MDR_DMA->CHNL_PRI_ALT_SET = (1 << DMA_Channel); /* Use alternate. */
    }

    /* Channel priority set */
    if (DMA_InitStruct->DMA_UseHighPriority == ENABLE) {
        MDR_DMA->CHNL_PRIORITY_SET = (1 << DMA_Channel); /* High priority. */
    } else {
        MDR_DMA->CHNL_PRIORITY_CLR = (1 << DMA_Channel); /* Default priority. */
    }

    /* Channel mask clear. */
    MDR_DMA->CHNL_REQ_MASK_CLR = (1 << DMA_Channel);
}

#if defined(DMA_ALTERNATE_DATA)
/**
 * @brief  Initialize the DMA channel in the scatter-gather mode.
 * @param  DMA_Channel: Select a DMA channel.
 *         This parameter can be in the range from 0 to 31 or a value of the @ref DMA_ValidChannel_TypeDef.
 * @param  DMA_SG_InitStruct: the pointer to the @ref DMA_SG_Channel_InitTypeDef array that
 *         contains the configuration information for the specified DMA channel.
 * @param  DMA_SG_Mode: @ref DMA_OperatingMode_TypeDef - specify the primary channel scatter-gather mode.
 *         This parameter can be one of the following values:
 *             @arg DMA_MODE_MEM_SG_PRIMARY: Memory scatter-gather mode;
 *             @arg DMA_MODE_PER_SG_PRIMARY: Peripheral scatter-gather mode.
 * @return None.
 */
void DMA_SG_ChannelInit(uint8_t DMA_Channel, const DMA_SG_Channel_InitTypeDef* DMA_SG_InitStruct, DMA_OperatingMode_TypeDef DMA_SG_Mode)
{
    DMA_CtrlData_InitTypeDef DMA_PriCtrlData;

    /* Check the parameters. */
    assert_param(DMA_SG_InitStruct != 0);
    assert_param(DMA_SG_InitStruct->DMA_SG_TaskNumber != 0);
    assert_param(IS_DMA_CHANNEL(DMA_Channel));
    assert_param(IS_FUNCTIONAL_STATE(DMA_SG_InitStruct->DMA_UseHighPriority));
    assert_param(IS_FUNCTIONAL_STATE(DMA_SG_InitStruct->DMA_UseBurst));
    assert_param(IS_DMA_SG_PRIMARY_MODE(DMA_SG_Mode));

    /* Check the CTRL_BASE_PTR initialization. */
    MDR_DMA->CTRL_BASE_PTR = (uint32_t)DMA_ControlTable;

    /* Primary control data init. */
    DMA_PriCtrlData.DMA_SourceBaseAddr    = (uint32_t)(DMA_SG_InitStruct->DMA_SG_TaskArray);
    DMA_PriCtrlData.DMA_DestBaseAddr      = (uint32_t)(&DMA_ControlTable[32 + DMA_Channel]);
    DMA_PriCtrlData.DMA_SourceIncSize     = DMA_DATA_INC_32BIT;
    DMA_PriCtrlData.DMA_DestIncSize       = DMA_DATA_INC_32BIT;
    DMA_PriCtrlData.DMA_MemoryDataSize    = DMA_MEMORY_DATA_SIZE_32BIT;
    DMA_PriCtrlData.DMA_Mode              = DMA_SG_Mode;
    DMA_PriCtrlData.DMA_CycleSize         = (DMA_SG_InitStruct->DMA_SG_TaskNumber) << 2;
    DMA_PriCtrlData.DMA_ArbitrationPeriod = DMA_ARB_AFTER_4;

    DMA_CtrlDataInit(&DMA_PriCtrlData, &DMA_ControlTable[DMA_Channel]);

    /* Burst mode. */
    if (DMA_SG_InitStruct->DMA_UseBurst == ENABLE) {
        MDR_DMA->CHNL_USEBURST_SET = (1 << DMA_Channel);
    } else {
        MDR_DMA->CHNL_USEBURST_CLR = (1 << DMA_Channel);
    }

    /* Primary - alternate control data structure selection. */
    MDR_DMA->CHNL_PRI_ALT_CLR = (1 << DMA_Channel); /* Use primary. */

    /* Set channel priority. */
    if (DMA_SG_InitStruct->DMA_UseHighPriority == ENABLE) {
        MDR_DMA->CHNL_PRIORITY_SET = (1 << DMA_Channel); /* High priority. */
    } else {
        MDR_DMA->CHNL_PRIORITY_CLR = (1 << DMA_Channel); /* Default priority. */
    }

    /* Clear channel mask. */
    MDR_DMA->CHNL_REQ_MASK_CLR = (1 << DMA_Channel);
}
#endif

/**
 * @brief  Fill each DMA_InitStruct member with its default value.
 * @param  DMA_InitStruct: The pointer to the @ref DMA_Channel_InitTypeDef structure
 *         to be initialized.
 * @return None.
 */
void DMA_StructInit(DMA_Channel_InitTypeDef* DMA_InitStruct)
{
    DMA_InitStruct->DMA_PriCtrlData         = 0;
    DMA_InitStruct->DMA_AltCtrlData         = 0;
    DMA_InitStruct->DMA_UseHighPriority     = DISABLE;
    DMA_InitStruct->DMA_UseBurst            = DISABLE;
    DMA_InitStruct->DMA_SelectDataStructure = DMA_CTRL_DATA_PRIMARY;
}

/**
 * @brief  Fill each DMA_SG_InitStruct member with its default value.
 * @param  DMA_SG_InitStruct: The pointer to the @ref DMA_SG_Channel_InitTypeDef structure
 *         to be be initialized.
 * @return None.
 */
void DMA_SG_StructInit(DMA_SG_Channel_InitTypeDef* DMA_SG_InitStruct)
{
    DMA_SG_InitStruct->DMA_SG_TaskArray    = 0;
    DMA_SG_InitStruct->DMA_SG_TaskNumber   = 0;
    DMA_SG_InitStruct->DMA_UseHighPriority = DISABLE;
    DMA_SG_InitStruct->DMA_UseBurst        = DISABLE;
}

/**
 * @brief  Enable or disable the specified DMA channel.
 * @param  DMA_Channel: Select a DMA channel.
 *         This parameter can be in the range from 0 to 31 or a value of the @ref DMA_ValidChannel_TypeDef.
 * @param  NewState: @ref FunctionalState - a new state of the DMA channel.
 * @return None.
 */
void DMA_ChannelCmd(uint8_t DMA_Channel, FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_DMA_CHANNEL(DMA_Channel));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Enable/Disable the channel. */
    if (NewState != DISABLE) {
        MDR_DMA->CHNL_ENABLE_SET = (1 << DMA_Channel);
    } else {
        MDR_DMA->CHNL_ENABLE_CLR = (1 << DMA_Channel);
    }
}

/**
 * @brief  Get the specified DMA channel permission state.
 * @param  DMA_Channel: Select a DMA channel.
 *         This parameter can be in the range from 0 to 31 or a value of the @ref DMA_ValidChannel_TypeDef.
 * @return @ref FunctionalState - the current permission state of the specified DMA channel.
 */
FunctionalState DMA_GetChannelCmdState(uint8_t DMA_Channel)
{
    FunctionalState State;

    /* Check the parameters. */
    assert_param(IS_DMA_CHANNEL(DMA_Channel));

    if ((MDR_DMA->CHNL_ENABLE_SET & (1 << DMA_Channel)) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

