piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_dma.c
    return State;
}

/**
 * @brief  Enable or disable request mask for the specified DMA channel.
 * @param  DMA_Channel: Select a DMA channel.
 *         This parameter can be in the range from 0 to 31 or a value of the @ref DMA_ValidChannel_TypeDef.
 * @param  NewState: @ref FunctionalState - a new state of the DMA channel request mask.
 * @return None.
 */
void DMA_ChannelRequestMaskCmd(uint8_t DMA_Channel, FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_DMA_CHANNEL(DMA_Channel));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Enable/Disable the channel request mask. */
    if (NewState != DISABLE) {
        MDR_DMA->CHNL_REQ_MASK_SET = (1 << DMA_Channel);
    } else {
        MDR_DMA->CHNL_REQ_MASK_CLR = (1 << DMA_Channel);
    }
}

/**
 * @brief  Get the specified DMA channel request mask state.
 * @param  DMA_Channel: Select a DMA channel.
 *         This parameter can be in the range from 0 to 31 or a value of the @ref DMA_ValidChannel_TypeDef.
 * @return @ref FunctionalState - the current request mask state of the specified DMA channel.
 */
FunctionalState DMA_GetChannelRequestMaskCmdState(uint8_t DMA_Channel)
{
    FunctionalState State;

    /* Check the parameters. */
    assert_param(IS_DMA_CHANNEL(DMA_Channel));

    if ((MDR_DMA->CHNL_REQ_MASK_SET & (1 << DMA_Channel)) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

    return State;
}

/**
 * @brief  Generate software request for the specified DMA channel.
 * @param  DMA_Channel: Select a DMA channel.
 *         This parameter can be in the range from 0 to 31 or a value of the @ref DMA_ValidChannel_TypeDef.
 * @return None.
 */
void DMA_ChannelRequest(uint8_t DMA_Channel)
{
    /* Check the parameters. */
    assert_param(IS_DMA_CHANNEL(DMA_Channel));

    /* Set the SW Request */
    MDR_DMA->CHNL_SW_REQUEST = (1 << DMA_Channel);
}

/**
 * @brief  Reload the DMA channel CycleSize and ChannelMode.
 * @param  DMA_Channel: Select a DMA channel.
 *         This parameter can be in the range from 0 to 31 or a value of the @ref DMA_ValidChannel_TypeDef.
 * @param  SelectDataStruct: @ref DMA_DataStructSelection_TypeDef - the data structure to change.
 * @param  CycleSize: New cycle size.
 * @param  ChannelMode: @ref DMA_OperatingMode_TypeDef - a new channel mode.
 * @return None.
 */
void DMA_ChannelReloadCycle(uint8_t DMA_Channel, DMA_DataStructSelection_TypeDef SelectDataStruct,
                            uint32_t CycleSize, DMA_OperatingMode_TypeDef ChannelMode)
{
    DMA_CtrlData_TypeDef* ChnlData;

    /* Check the parameters. */
    assert_param(IS_DMA_CHANNEL(DMA_Channel));
    assert_param(IS_DMA_SELECT_DATA_STRUCTURE(SelectDataStruct));
    assert_param(IS_DMA_CYCLE_SIZE(CycleSize));
    assert_param(IS_DMA_MODE(ChannelMode));

#if defined(DMA_ALTERNATE_DATA)
    if (SelectDataStruct == DMA_CTRL_DATA_PRIMARY) {
#endif
        ChnlData = &DMA_ControlTable[DMA_Channel];
#if defined(DMA_ALTERNATE_DATA)
    } else {
        ChnlData = &DMA_ControlTable[32 + DMA_Channel];
    }
#endif

    ChnlData->DMA_Control.w = (ChnlData->DMA_Control.w & ~(DMA_CHANNEL_CFG_N_MINUS_1_Msk | DMA_CHANNEL_CFG_CYCLE_CTRL_Msk | DMA_CHANNEL_CFG_NEXT_USEBURST_Msk)) |
                              ((CycleSize - 1) << DMA_CHANNEL_CFG_N_MINUS_1_Pos) | ((uint32_t)ChannelMode);
}

/**
 * @brief  Return the number of remaining transfers in the current DMA channel cycle.
 * @param  DMA_Channel: Select a DMA channel.
 *         This parameter can be in the range from 0 to 31 or a value of the @ref DMA_ValidChannel_TypeDef.
 * @param  SelectDataStruct: @ref DMA_DataStructSelection_TypeDef - specify
 *         the primary / alternate control data table to check.
 * @return The number of the remaining transfers in the current
 *         DMA channel cycle and the current control data structure.
 */
uint32_t DMA_GetChannelTransferCounter(uint8_t DMA_Channel, DMA_DataStructSelection_TypeDef SelectDataStruct)
{
    DMA_CtrlData_TypeDef* ChnlData;

    /* Check the parameters. */
    assert_param(IS_DMA_CHANNEL(DMA_Channel));
    assert_param(IS_DMA_SELECT_DATA_STRUCTURE(SelectDataStruct));

#if defined(DMA_ALTERNATE_DATA)
    if (SelectDataStruct == DMA_CTRL_DATA_PRIMARY) {
#endif
        ChnlData = &DMA_ControlTable[DMA_Channel];
#if defined(DMA_ALTERNATE_DATA)
    } else {
        ChnlData = &DMA_ControlTable[32 + DMA_Channel];
    }
#endif

    return (((ChnlData->DMA_Control.w & DMA_CHANNEL_CFG_N_MINUS_1_Msk) >> DMA_CHANNEL_CFG_N_MINUS_1_Pos) + 1);
}

/**
 * @brief  Select data structure for DMA channel.
 * @param  DMA_Channel: Select a DMA channel.
 *         This parameter can be in the range from 0 to 31 or a value of the @ref DMA_ValidChannel_TypeDef.
 * @param  SelectDataStruct: @ref DMA_DataStructSelection_TypeDef - specify
 *         the primary / alternate data structure to use.
 * @return None.
 */
void DMA_ChannelSetControl(uint8_t DMA_Channel, DMA_DataStructSelection_TypeDef SelectDataStruct)
{
    /* Check the parameters. */
    assert_param(IS_DMA_CHANNEL(DMA_Channel));
    assert_param(IS_DMA_SELECT_DATA_STRUCTURE(SelectDataStruct));

    /* Primary or alternate control data structure selection. */
    if (SelectDataStruct == DMA_CTRL_DATA_PRIMARY) {
        MDR_DMA->CHNL_PRI_ALT_CLR = (1 << DMA_Channel); /* Use primary. */
    } else {
        MDR_DMA->CHNL_PRI_ALT_SET = (1 << DMA_Channel); /* Use alternate. */
    }
}

/**
 * @brief  Get data structure used by DMA channel.
 * @param  DMA_Channel: Select a DMA channel.
 *         This parameter can be in the range from 0 to 31 or a value of the @ref DMA_ValidChannel_TypeDef.
 * @return @ref DMA_DataStructSelection_TypeDef - data structure (primary or alternate) used by DMA channel.
 */
DMA_DataStructSelection_TypeDef DMA_ChannelGetControl(uint8_t DMA_Channel)
{
    /* Check the parameters. */
    assert_param(IS_DMA_CHANNEL(DMA_Channel));

    return (DMA_DataStructSelection_TypeDef)((MDR_DMA->CHNL_PRI_ALT_CLR & (1 << DMA_Channel)) != 0);
}

/**
 * @brief  Return the current DMA channel operating mode.
 * @param  DMA_Channel: Select a DMA channel.
 *         This parameter can be in the range from 0 to 31 or a value of the @ref DMA_ValidChannel_TypeDef.
 * @param  SelectDataStruct: @ref DMA_DataStructSelection_TypeDef - specify
 *         the primary / alternate control data table to check.
 * @return @ref DMA_OperatingMode_TypeDef - the current DMA channel state.
 */
DMA_OperatingMode_TypeDef DMA_GetChannelMode(uint8_t DMA_Channel, DMA_DataStructSelection_TypeDef SelectDataStruct)
{
    DMA_OperatingMode_TypeDef ChannelMode;
    DMA_CtrlData_TypeDef*     ChnlData;

    /* Check the parameters. */
    assert_param(IS_DMA_CHANNEL(DMA_Channel));
    assert_param(IS_DMA_SELECT_DATA_STRUCTURE(SelectDataStruct));

#if defined(DMA_ALTERNATE_DATA)
    if (SelectDataStruct == DMA_CTRL_DATA_PRIMARY) {
#endif
        ChnlData = &DMA_ControlTable[DMA_Channel];
#if defined(DMA_ALTERNATE_DATA)
    } else {
        ChnlData = &DMA_ControlTable[32 + DMA_Channel];
    }
#endif

