piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_dma.c
    ChannelMode = (DMA_OperatingMode_TypeDef)(ChnlData->DMA_Control.w & DMA_CHANNEL_CFG_CYCLE_CTRL_Msk);
    if (ChannelMode == DMA_MODE_PER_SG_ALTERNATE) {
        ChannelMode = (DMA_OperatingMode_TypeDef)(ChnlData->DMA_Control.w & (DMA_CHANNEL_CFG_CYCLE_CTRL_Msk | DMA_CHANNEL_CFG_NEXT_USEBURST_Msk));
    }

    return ChannelMode;
}

/**
 * @brief  Check whether the specified DMA channel flag is set or not.
 * @param  DMA_Channel: Select a DMA channel.
 *         This parameter can be in the range from 0 to 31 or a value of @ref DMA_ValidChannel_TypeDef and
 *         is not used when the DMA_FLAG_DMA_ENA or DMA_FLAG_DMA_ERR flags are being checked.
 * @param  DMA_Flag: @ref DMA_Flags_TypeDef - specify the flag to check.
 * @return @ref FlagStatus - Current state of DMA_FLAG (SET or RESET).
 */
FlagStatus DMA_GetFlagStatus(uint8_t DMA_Channel, DMA_Flags_TypeDef DMA_Flag)
{
    FlagStatus Status = RESET;

    /* Check the parameters. */
    assert_param(IS_DMA_CHANNEL(DMA_Channel));
    assert_param(IS_DMA_FLAG(DMA_Flag));

    /* Read the flag status. */
    switch (DMA_Flag) {
        case DMA_FLAG_DMA_ENABLED:
            Status = (FlagStatus)((MDR_DMA->STATUS & DMA_STATUS_MASTER_ENABLE) != 0);
            break;
        case DMA_FLAG_DMA_ERR:
            Status = (FlagStatus)((MDR_DMA->ERR_CLR & DMA_ERR_CLR_ERR_CLR) != 0);
            break;
        case DMA_FLAG_CHANNEL_ENABLED:
            Status = (FlagStatus)((MDR_DMA->CHNL_ENABLE_SET & (1 << DMA_Channel)) != 0);
            break;
        case DMA_FLAG_CHANNEL_MASK:
            Status = (FlagStatus)((MDR_DMA->CHNL_REQ_MASK_SET & (1 << DMA_Channel)) != 0);
            break;
        case DMA_FLAG_CHANNEL_WAIT:
            Status = (FlagStatus)((MDR_DMA->WAITONREQ_STATUS & (1 << DMA_Channel)) != 0);
            break;
        case DMA_FLAG_CHANNEL_BURST:
            Status = (FlagStatus)((MDR_DMA->CHNL_USEBURST_SET & (1 << DMA_Channel)) != 0);
            break;
        case DMA_FLAG_CHANNEL_ALTERNATE:
            Status = (FlagStatus)((MDR_DMA->CHNL_PRI_ALT_SET & (1 << DMA_Channel)) != 0);
            break;
        case DMA_FLAG_CHANNEL_PRIORITY:
            Status = (FlagStatus)((MDR_DMA->CHNL_PRIORITY_SET & (1 << DMA_Channel)) != 0);
            break;
    }
    return Status;
}

/**
 * @brief  Clear the DMA Error bit.
 * @param  None.
 * @return None.
 */
void DMA_ClearError(void)
{
    MDR_DMA->ERR_CLR = DMA_ERR_CLR_ERR_CLR;
}

/**
 * @brief  Get the current DMA state.
 * @return @ref DMA_State_TypeDef - the DMA state.
 */
DMA_State_TypeDef DMA_GetState(void)
{
    return (DMA_State_TypeDef)(MDR_DMA->STATUS & DMA_STATUS_STATE_Msk);
}

/** @} */ /* End of the group DMA_Exported_Functions */

/** @} */ /* End of the group DMA */

/** @} */ /* End of the group MDR32VF0xI_StdPeriph_Driver */

/*********************** (C) COPYRIGHT 2025 Milandr ****************************
 *
 * END OF FILE MDR32VF0xI_dma.c */

